{"pageProps":{"res":{"count":1,"next":null,"previous":null,"results":[{"id":1,"title":"GatsbyNFT","challenge":"The project was centered around NFTs where each minted NFT acted as the membership of the Gatsby club. The challenge was to give a user-friendly admin dashboard for uploading the NFT metadata and images. The admin dashboard needed to be simple to use, quick to load, and function properly on all browsers and devices. Also, smart contract had some exciting features like time or status based NFT’s whitelisting and royalties on secondary sales. Primarily, it was a way to get paid royalties on secondary sales without resorting to complex decentralized computing mechanisms.","solution":"The backend of this project was built in Django Rest Framework for the seamless management and creation of metadata. The frontend that consumed these APIs was built on React JS for the mobile-friendly interface and mobile-compatible wallet connection support. This allowed us to build a highly adaptable app using modern web technologies like React, Python which can be scaled and maintained using the same technologies that power modern web sites and web applications use. Google Cloud Storage was used to store Meta data so it was readily available and could be updated anytime.","tech":"Django Rest Framework, React JS, Google Cloud Storage, Pinata IP, Solidity, Hardhat, Ethereum API, Remix IDE","services":"Consulting, Project Management, Frontend Development, Backend Development, DevOps, Quality Assurance","architecture":"Ethereum, Linode Ubuntu Server, Google Cloud Services","industry":"Blockchain, Decentralized Application","timeline":"6 Months","website":"https://mint.gatsbynft.io/","views":44,"rating":"5","creation_date":"2023-05-02","edited_date":"2023-08-05","author":"Hamza Imtiaz","thumbnail":"https://api.pos.coaldev.com/media/media/Gatsby_NFT_fdm2rQb.jpg","status":false,"tag":[{"id":2,"tag_name":"Blockchain"},{"id":5,"tag_name":"Custom Web Development"},{"id":7,"tag_name":"Smart Contracts"},{"id":8,"tag_name":"NFT"}]}]}},"__N_SSG":true}