{"pageProps":{"res":{"count":1,"next":null,"previous":null,"results":[{"id":8,"title":"Leadpipe","challenge":"The real estate industry is a constantly evolving market that is influenced by various factors, including location, pricing, property type, and other market trends. Property sellers are often looking for ways to estimate the duration it would take to sell their property. In this project, we aim to develop a system to predict the time it would take for a property to get sold based on various factors such as location, property type, size, amenities, and pricing. The goal is to provide property sellers with an accurate and reliable estimate of the duration in which their property would get sold, which would help them make informed decisions about pricing and marketing strategies.","solution":"Our project involved developing a solution to predict the duration in which a property would get sold. We analyzed various data points such as location, property type, size, amenities, and pricing, and assigned a score ranging from 1-1000 to each property based on these factors. A higher score indicated that the property would be sold in a shorter duration of time. This scoring system provides property sellers with an accurate and reliable estimate of the duration in which their property would get sold, which enables them to make informed decisions about pricing and marketing strategies.","tech":"Python, Django, Tensorflow, ML, DL, Time series Analysis, GCP, Kubernetes","services":"Data Analysis and Modelling, Cloud Computing, Cyber Security, Technical Support, API Integration","architecture":"Kubernetes, GCP","industry":"Real-estate, Marketing","timeline":"8 Months","website":"","views":17,"rating":"4","creation_date":"2023-05-15","edited_date":"2023-08-01","author":"Malvin Rios","thumbnail":"https://api.pos.coaldev.com/media/media/Leadpipe.png","status":false,"tag":[{"id":1,"tag_name":"Remote"},{"id":3,"tag_name":"Data Science"},{"id":5,"tag_name":"Custom Web Development"}]}]}},"__N_SSG":true}