{"pageProps":{"res":{"count":1,"next":null,"previous":null,"results":[{"id":9,"title":"SearchLook Security Trace","challenge":"The problem at hand was to implement a comprehensive security and traceability system within an existing product. From a security perspective, the challenge involved creating a strong Two-Factor Authentication (2FA) system for both the backend and front end and a multi-channel OTP delivery for enhanced security. To achieve traceability, user activities had to be logged for each request, and a frontend feature for downloading the activities. Striking a balance between security, usability, and data protection was essential to ensure a smooth and secure user experience throughout the project","solution":"The solution addressed both security and traceability aspects. For security, we created endpoints for Two-Factor Authentication (2FA) using the Twilio verification service for secure OTP handling. The login process was updated to accommodate 2FA and non-2FA scenarios, and APIs for setting up 2FA with multi-channel OTP delivery (SMS, email) were implemented. To ensure traceability, we added endpoints for user deactivation and retrieving user activities. We also included a user-friendly report generation feature for activity records download. The workflow successfully tackled 2FA, user activation/deactivation, and user activity tracking, and implemented a unique identifier for enhanced security in the Searchlook security project.","tech":"Python Flask, JavaScript, Vue JS, MongoDB, Twilio","services":"Authentication and security services, Integration Services, Full stack development, User Management Service, Quality Assurance and testing, Deployment and maintenance","architecture":"AWS, Linode","industry":"IT Service & IT consulting","timeline":"6 Month","website":"searchlook.org","views":15,"rating":"4","creation_date":"2023-07-27","edited_date":"2023-08-01","author":"Huda Sohail","thumbnail":"https://api.pos.coaldev.com/media/media/final-dl.beatsnoop.com-m5Dn24CYiT.jpg","status":false,"tag":[{"id":5,"tag_name":"Custom Web Development"}]}]}},"__N_SSG":true}